theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*
** ###################################################################
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          GNU C Compiler - CodeSourcery Sourcery G++
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    KV4XP100M150RM Rev 2, 02/2015
**     Version:             rev. 1.2, 2015-11-02
**     Build:               b150312
**
**     Abstract:
**         Extension to the CMSIS register access layer header.
**
**     Copyright (c) 2015 Freescale Semiconductor, Inc.
**     All rights reserved.
**
**     Redistribution and use in source and binary forms, with or without modification,
**     are permitted provided that the following conditions are met:
**
**     o Redistributions of source code must retain the above copyright notice, this list
**       of conditions and the following disclaimer.
**
**     o Redistributions in binary form must reproduce the above copyright notice, this
**       list of conditions and the following disclaimer in the documentation and/or
**       other materials provided with the distribution.
**
**     o Neither the name of Freescale Semiconductor, Inc. nor the names of its
**       contributors may be used to endorse or promote products derived from this
**       software without specific prior written permission.
**
**     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
**     ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
**     WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
**     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
**     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
**     ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
**     (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
**     SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 0.1 (2014-01-27)
**         Initial version.
**     - rev. 1.0 (2014-07-29)
**         FPU initialization and VLLSx wake-up recovery added to the system initialization
**     - rev. 1.1 (2014-10-14)
**         Renamed interrupt vector I2C to I2C0 and LPTimer to LPTMR0
**     - rev. 1.2 (2015-11-02)
**         AIPS registers have been added.
**
** ###################################################################
*/

/*
 * WARNING! DO NOT EDIT THIS FILE DIRECTLY!
 *
 * This file was generated automatically and any changes may be lost.
 */
#ifndef __MKV40F15_EXTENSION_H__
#define __MKV40F15_EXTENSION_H__

#include "MKV40F15.h"
#include "fsl_bitaccess.h"

/*
 * MKV40F15 ADC
 *
 * Analog to digital converter
 *
 * Registers defined in this header file:
 * - ADC_CTRL1 - ADC Control Register 1
 * - ADC_CTRL2 - ADC Control Register 2
 * - ADC_ZXCTRL1 - ADC Zero Crossing Control 1 Register
 * - ADC_ZXCTRL2 - ADC Zero Crossing Control 2 Register
 * - ADC_CLIST1 - ADC Channel List Register 1
 * - ADC_CLIST2 - ADC Channel List Register 2
 * - ADC_CLIST3 - ADC Channel List Register 3
 * - ADC_CLIST4 - ADC Channel List Register 4
 * - ADC_SDIS - ADC Sample Disable Register
 * - ADC_STAT - ADC Status Register
 * - ADC_RDY - ADC Ready Register
 * - ADC_LOLIMSTAT - ADC Low Limit Status Register
 * - ADC_HILIMSTAT - ADC High Limit Status Register
 * - ADC_ZXSTAT - ADC Zero Crossing Status Register
 * - ADC_RSLT - ADC Result Registers with sign extension
 * - ADC_LOLIM - ADC Low Limit Registers
 * - ADC_HILIM - ADC High Limit Registers
 * - ADC_OFFST - ADC Offset Registers
 * - ADC_PWR - ADC Power Control Register
 * - ADC_CAL - ADC Calibration Register
 * - ADC_GC1 - Gain Control 1 Register
 * - ADC_GC2 - Gain Control 2 Register
 * - ADC_SCTRL - ADC Scan Control Register
 * - ADC_PWR2 - ADC Power Control Register
 * - ADC_CTRL3 - ADC Control Register 3
 * - ADC_SCHLTEN - ADC Scan Interrupt Enable Register
 */

#define ADC_INSTANCE_COUNT (1U) /*!< Number of instances of the ADC module. */
#define ADC_IDX (0U) /*!< Instance number for ADC. */

/*******************************************************************************
 * ADC_CTRL1 - ADC Control Register 1
 ******************************************************************************/

/*!
 * @brief ADC_CTRL1 - ADC Control Register 1 (RW)
 *
 * Reset value: 0x5005U
 *
 * Bits 14, 13, 12, and 11 in CTRL1 control all types of scans except parallel
 * scans in the B converter when CTRL2[SIMULT]=0. Non-simultaneous parallel scan
 * modes allow independent parallel scanning in the A and B converter. Bits 14,
 * 13, 12, and 11 in CTRL2 are used to control B converter scans in
 * non-simultaneous parallel scan modes.
 */
/*!
 * @name Constants and macros for entire ADC_CTRL1 register
 */
/*@{*/
#define ADC_RD_CTRL1(base)       (ADC_CTRL1_REG(base))
#define ADC_WR_CTRL1(base, value) (ADC_CTRL1_REG(base) = (value))
#define ADC_RMW_CTRL1(base, mask, value) (ADC_WR_CTRL1(base, (ADC_RD_CTRL1(base) & ~(mask)) | (value)))
#define ADC_SET_CTRL1(base, value) (ADC_WR_CTRL1(base, ADC_RD_CTRL1(base) |  (value)))
#define ADC_CLR_CTRL1(base, value) (ADC_WR_CTRL1(base, ADC_RD_CTRL1(base) & ~(value)))
#define ADC_TOG_CTRL1(base, value) (ADC_WR_CTRL1(base, ADC_RD_CTRL1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CTRL1 bitfields
 */

/*!
 * @name Register ADC_CTRL1, field SMODE[2:0] (RW)
 *
 * This field controls the ADC module's scan mode. All scan modes use 16 sample
 * slots defined by the CLIST1-4 registers. A scan is the process of stepping
 * through a subset of these sample slots, converting the input indicated by a slot,
 * and storing the result. Unused slots may be disabled using the SDIS register.
 * Input pairs ANA0-1, ANA2-3, ANA4-5, ANA6-7, ANB0-1, ANB2-3, ANB4-5, and
 * ANB6-7 may be configured as differential pairs using the CHNCFG fields. When a slot
 * refers to either member of a differential pair, a differential measurement on
 * that pair is made; otherwise, a single ended measurement is taken on that
 * input. The CTRL*[CHNCFG] fields' descriptions detail differential and single
 * ended measurement. The SMODE field determines whether the slots are used to
 * perform one long sequential scan or two shorter parallel scans, each performed by
 * one of the two converters. SMODE controls how these scans are initiated and
 * terminated. It also controls whether the scans are performed once or repetitively.
 * For details, refer to Sequential Versus Parallel Sampling and Scan Sequencing
 * . Parallel scans may be simultaneous (CTRL2[SIMULT] is 1) or
 * non-simultaneous. Simultaneous parallel scans perform the A and B converter scan in lock step
 * using one set of shared controls. Non-simultaneous parallel scans operate the
 * A and B converters independently, with each converter using its own set of
 * controls. Refer to the CTRL2[SIMULT] bit's description for details. Setting any
 * sequential mode overrides the setting of CTRL2[SIMULT].
 *
 * Values:
 * - 000 - Once (single) sequential
 * - 001 - Once parallel
 * - 010 - Loop sequential
 * - 011 - Loop parallel
 * - 100 - Triggered sequential
 * - 101 - Triggered parallel (default)
 * - 110 - Reserved
 * - 111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL1_SMODE field. */
#define ADC_RD_CTRL1_SMODE(base) ((ADC_CTRL1_REG(base) & ADC_CTRL1_SMODE_MASK) >> ADC_CTRL1_SMODE_SHIFT)
#define ADC_BRD_CTRL1_SMODE(base) (ADC_RD_CTRL1_SMODE(base))

/*! @brief Set the SMODE field to a new value. */
#define ADC_WR_CTRL1_SMODE(base, value) (ADC_RMW_CTRL1(base, ADC_CTRL1_SMODE_MASK, ADC_CTRL1_SMODE(value)))
#define ADC_BWR_CTRL1_SMODE(base, value) (ADC_WR_CTRL1_SMODE(base, value))
/*@}*/

/*!
 * @name Register ADC_CTRL1, field CHNCFG_L[7:4] (RW)
 *
 * The bits configure the analog inputs for either single ended or differential
 * conversions. Differential measurements return the max value ((2**12)-1) when
 * the + input is V REFH and the - input is VREFLO , return 0 when the + input is
 * at V REFLO and the - input is at VREFH , and scale linearly between based on
 * the voltage difference between the two signals. Single ended measurements
 * return the max value when the input is at V REFH , return 0 when the input is at
 * VREFLO, and scale linearly between based on the amount by which the input
 * exceeds VREFLO. xxx1 Inputs = ANA0-ANA1 - Configured as differential pair (ANA0 is +
 * and ANA1 is -) xxx0 Inputs = ANA0-ANA1 - Both configured as single ended
 * inputs xx1x Inputs = ANA2-ANA3 - Configured as differential pair (ANA2 is + and
 * ANA3 is -) xx0x Inputs = ANA2-ANA3 - Both configured as single ended inputs x1xx
 * Inputs = ANB0-ANB1 - Configured as differential pair (ANB0 is + and ANB1 is
 * -) x0xx Inputs = ANB0-ANB1 - Both configured as single ended inputs 1xxx Inputs
 * = ANB2-ANB3 - Configured as differential pair (ANB2 is + and ANB3 is -) 0xxx
 * Inputs = ANB2-ANB3 - Both configured as single ended inputs
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL1_CHNCFG_L field. */
#define ADC_RD_CTRL1_CHNCFG_L(base) ((ADC_CTRL1_REG(base) & ADC_CTRL1_CHNCFG_L_MASK) >> ADC_CTRL1_CHNCFG_L_SHIFT)
#define ADC_BRD_CTRL1_CHNCFG_L(base) (ADC_RD_CTRL1_CHNCFG_L(base))

/*! @brief Set the CHNCFG_L field to a new value. */
#define ADC_WR_CTRL1_CHNCFG_L(base, value) (ADC_RMW_CTRL1(base, ADC_CTRL1_CHNCFG_L_MASK, ADC_CTRL1_CHNCFG_L(value)))
#define ADC_BWR_CTRL1_CHNCFG_L(base, value) (ADC_WR_CTRL1_CHNCFG_L(base, value))
/*@}*/

/*!
 * @name Register ADC_CTRL1, field HLMTIE[8] (RW)
 *
 * This bit enables the High Limit exceeded interrupt if the current result
 * value is greater than the high limit register value. The raw result value is
 * compared to HILIM[HLMT] before the offset register value is subtracted.
 *
 * Values:
 * - 0 - Interrupt disabled
 * - 1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL1_HLMTIE field. */
#define ADC_RD_CTRL1_HLMTIE(base) ((ADC_CTRL1_REG(base) & ADC_CTRL1_HLMTIE_MASK) >> ADC_CTRL1_HLMTIE_SHIFT)
#define ADC_BRD_CTRL1_HLMTIE(base) (BITBAND_ACCESS16(&ADC_CTRL1_REG(base), ADC_CTRL1_HLMTIE_SHIFT))

