theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*! @brief Set the DMAEN1 field to a new value. */
#define ADC_WR_CTRL2_DMAEN1(base, value) (ADC_RMW_CTRL2(base, ADC_CTRL2_DMAEN1_MASK, ADC_CTRL2_DMAEN1(value)))
#define ADC_BWR_CTRL2_DMAEN1(base, value) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_DMAEN1_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ADC_ZXCTRL1 - ADC Zero Crossing Control 1 Register
 ******************************************************************************/

/*!
 * @brief ADC_ZXCTRL1 - ADC Zero Crossing Control 1 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ADC_ZXCTRL1 register
 */
/*@{*/
#define ADC_RD_ZXCTRL1(base)     (ADC_ZXCTRL1_REG(base))
#define ADC_WR_ZXCTRL1(base, value) (ADC_ZXCTRL1_REG(base) = (value))
#define ADC_RMW_ZXCTRL1(base, mask, value) (ADC_WR_ZXCTRL1(base, (ADC_RD_ZXCTRL1(base) & ~(mask)) | (value)))
#define ADC_SET_ZXCTRL1(base, value) (ADC_WR_ZXCTRL1(base, ADC_RD_ZXCTRL1(base) |  (value)))
#define ADC_CLR_ZXCTRL1(base, value) (ADC_WR_ZXCTRL1(base, ADC_RD_ZXCTRL1(base) & ~(value)))
#define ADC_TOG_ZXCTRL1(base, value) (ADC_WR_ZXCTRL1(base, ADC_RD_ZXCTRL1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_ZXCTRL1 bitfields
 */

/*!
 * @name Register ADC_ZXCTRL1, field ZCE0[1:0] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL1_ZCE0 field. */
#define ADC_RD_ZXCTRL1_ZCE0(base) ((ADC_ZXCTRL1_REG(base) & ADC_ZXCTRL1_ZCE0_MASK) >> ADC_ZXCTRL1_ZCE0_SHIFT)
#define ADC_BRD_ZXCTRL1_ZCE0(base) (ADC_RD_ZXCTRL1_ZCE0(base))

/*! @brief Set the ZCE0 field to a new value. */
#define ADC_WR_ZXCTRL1_ZCE0(base, value) (ADC_RMW_ZXCTRL1(base, ADC_ZXCTRL1_ZCE0_MASK, ADC_ZXCTRL1_ZCE0(value)))
#define ADC_BWR_ZXCTRL1_ZCE0(base, value) (ADC_WR_ZXCTRL1_ZCE0(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL1, field ZCE1[3:2] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL1_ZCE1 field. */
#define ADC_RD_ZXCTRL1_ZCE1(base) ((ADC_ZXCTRL1_REG(base) & ADC_ZXCTRL1_ZCE1_MASK) >> ADC_ZXCTRL1_ZCE1_SHIFT)
#define ADC_BRD_ZXCTRL1_ZCE1(base) (ADC_RD_ZXCTRL1_ZCE1(base))

/*! @brief Set the ZCE1 field to a new value. */
#define ADC_WR_ZXCTRL1_ZCE1(base, value) (ADC_RMW_ZXCTRL1(base, ADC_ZXCTRL1_ZCE1_MASK, ADC_ZXCTRL1_ZCE1(value)))
#define ADC_BWR_ZXCTRL1_ZCE1(base, value) (ADC_WR_ZXCTRL1_ZCE1(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL1, field ZCE2[5:4] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL1_ZCE2 field. */
#define ADC_RD_ZXCTRL1_ZCE2(base) ((ADC_ZXCTRL1_REG(base) & ADC_ZXCTRL1_ZCE2_MASK) >> ADC_ZXCTRL1_ZCE2_SHIFT)
#define ADC_BRD_ZXCTRL1_ZCE2(base) (ADC_RD_ZXCTRL1_ZCE2(base))

/*! @brief Set the ZCE2 field to a new value. */
#define ADC_WR_ZXCTRL1_ZCE2(base, value) (ADC_RMW_ZXCTRL1(base, ADC_ZXCTRL1_ZCE2_MASK, ADC_ZXCTRL1_ZCE2(value)))
#define ADC_BWR_ZXCTRL1_ZCE2(base, value) (ADC_WR_ZXCTRL1_ZCE2(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL1, field ZCE3[7:6] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL1_ZCE3 field. */
#define ADC_RD_ZXCTRL1_ZCE3(base) ((ADC_ZXCTRL1_REG(base) & ADC_ZXCTRL1_ZCE3_MASK) >> ADC_ZXCTRL1_ZCE3_SHIFT)
#define ADC_BRD_ZXCTRL1_ZCE3(base) (ADC_RD_ZXCTRL1_ZCE3(base))

/*! @brief Set the ZCE3 field to a new value. */
#define ADC_WR_ZXCTRL1_ZCE3(base, value) (ADC_RMW_ZXCTRL1(base, ADC_ZXCTRL1_ZCE3_MASK, ADC_ZXCTRL1_ZCE3(value)))
#define ADC_BWR_ZXCTRL1_ZCE3(base, value) (ADC_WR_ZXCTRL1_ZCE3(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL1, field ZCE4[9:8] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL1_ZCE4 field. */
#define ADC_RD_ZXCTRL1_ZCE4(base) ((ADC_ZXCTRL1_REG(base) & ADC_ZXCTRL1_ZCE4_MASK) >> ADC_ZXCTRL1_ZCE4_SHIFT)
#define ADC_BRD_ZXCTRL1_ZCE4(base) (ADC_RD_ZXCTRL1_ZCE4(base))

/*! @brief Set the ZCE4 field to a new value. */
#define ADC_WR_ZXCTRL1_ZCE4(base, value) (ADC_RMW_ZXCTRL1(base, ADC_ZXCTRL1_ZCE4_MASK, ADC_ZXCTRL1_ZCE4(value)))
#define ADC_BWR_ZXCTRL1_ZCE4(base, value) (ADC_WR_ZXCTRL1_ZCE4(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL1, field ZCE5[11:10] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL1_ZCE5 field. */
#define ADC_RD_ZXCTRL1_ZCE5(base) ((ADC_ZXCTRL1_REG(base) & ADC_ZXCTRL1_ZCE5_MASK) >> ADC_ZXCTRL1_ZCE5_SHIFT)
#define ADC_BRD_ZXCTRL1_ZCE5(base) (ADC_RD_ZXCTRL1_ZCE5(base))

/*! @brief Set the ZCE5 field to a new value. */
#define ADC_WR_ZXCTRL1_ZCE5(base, value) (ADC_RMW_ZXCTRL1(base, ADC_ZXCTRL1_ZCE5_MASK, ADC_ZXCTRL1_ZCE5(value)))
#define ADC_BWR_ZXCTRL1_ZCE5(base, value) (ADC_WR_ZXCTRL1_ZCE5(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL1, field ZCE6[13:12] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL1_ZCE6 field. */
#define ADC_RD_ZXCTRL1_ZCE6(base) ((ADC_ZXCTRL1_REG(base) & ADC_ZXCTRL1_ZCE6_MASK) >> ADC_ZXCTRL1_ZCE6_SHIFT)
#define ADC_BRD_ZXCTRL1_ZCE6(base) (ADC_RD_ZXCTRL1_ZCE6(base))

