theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*! @brief Set the GAIN14 field to a new value. */
#define ADC_WR_GC2_GAIN14(base, value) (ADC_RMW_GC2(base, ADC_GC2_GAIN14_MASK, ADC_GC2_GAIN14(value)))
#define ADC_BWR_GC2_GAIN14(base, value) (ADC_WR_GC2_GAIN14(base, value))
/*@}*/

/*!
 * @name Register ADC_GC2, field GAIN15[15:14] (RW)
 *
 * GAIN 15 controls ANB7
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC2_GAIN15 field. */
#define ADC_RD_GC2_GAIN15(base) ((ADC_GC2_REG(base) & ADC_GC2_GAIN15_MASK) >> ADC_GC2_GAIN15_SHIFT)
#define ADC_BRD_GC2_GAIN15(base) (ADC_RD_GC2_GAIN15(base))

/*! @brief Set the GAIN15 field to a new value. */
#define ADC_WR_GC2_GAIN15(base, value) (ADC_RMW_GC2(base, ADC_GC2_GAIN15_MASK, ADC_GC2_GAIN15(value)))
#define ADC_BWR_GC2_GAIN15(base, value) (ADC_WR_GC2_GAIN15(base, value))
/*@}*/

/*******************************************************************************
 * ADC_SCTRL - ADC Scan Control Register
 ******************************************************************************/

/*!
 * @brief ADC_SCTRL - ADC Scan Control Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is an extension to the CLIST1-4 registers, providing the
 * ability to pause and await a new sync while processing samples programmed in the
 * CLIST*[SAMPLE0-SAMPLE15] fields. These 16 control bits are used to determine
 * whether a sample in a scan occurs immediately or if the sample waits for an
 * enabled sync input to occur. The sync input must occur after the conversion of the
 * current sample completes. During sequential mode scans, the SCTRL[SC] bits are
 * used in order from SC0 to SC15. During simultaneous parallel scan modes, the
 * bits are used in order from SC0 to SC3 and SC8 to SC11. In non-simultaneous
 * parallel scans, ADCA uses the bits in order from SC0 to SC3 followed by SC8 to
 * SC11. ADCB will use bits SC4 to SC7 followed by SC12 to SC15 in non-simultaneous
 * parallel scans. When setting SCTRL[SC0], don't set CTRL1[START0] or
 * CTRL2[START1]. Just clear CTRL1[STOP0] or CTRL2[STOP1] and the first enabled sync input
 * will start the scan. Setting SC0 delays sample 0 until a sync pulse occurs.
 * Setting SC1 delays sample 1 until a sync pulse occurs after completing sample 0.
 */
/*!
 * @name Constants and macros for entire ADC_SCTRL register
 */
/*@{*/
#define ADC_RD_SCTRL(base)       (ADC_SCTRL_REG(base))
#define ADC_WR_SCTRL(base, value) (ADC_SCTRL_REG(base) = (value))
#define ADC_RMW_SCTRL(base, mask, value) (ADC_WR_SCTRL(base, (ADC_RD_SCTRL(base) & ~(mask)) | (value)))
#define ADC_SET_SCTRL(base, value) (ADC_WR_SCTRL(base, ADC_RD_SCTRL(base) |  (value)))
#define ADC_CLR_SCTRL(base, value) (ADC_WR_SCTRL(base, ADC_RD_SCTRL(base) & ~(value)))
#define ADC_TOG_SCTRL(base, value) (ADC_WR_SCTRL(base, ADC_RD_SCTRL(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ADC_PWR2 - ADC Power Control Register
 ******************************************************************************/

/*!
 * @brief ADC_PWR2 - ADC Power Control Register (RW)
 *
 * Reset value: 0x0400U
 */
/*!
 * @name Constants and macros for entire ADC_PWR2 register
 */
/*@{*/
#define ADC_RD_PWR2(base)        (ADC_PWR2_REG(base))
#define ADC_WR_PWR2(base, value) (ADC_PWR2_REG(base) = (value))
#define ADC_RMW_PWR2(base, mask, value) (ADC_WR_PWR2(base, (ADC_RD_PWR2(base) & ~(mask)) | (value)))
#define ADC_SET_PWR2(base, value) (ADC_WR_PWR2(base, ADC_RD_PWR2(base) |  (value)))
#define ADC_CLR_PWR2(base, value) (ADC_WR_PWR2(base, ADC_RD_PWR2(base) & ~(value)))
#define ADC_TOG_PWR2(base, value) (ADC_WR_PWR2(base, ADC_RD_PWR2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_PWR2 bitfields
 */

/*!
 * @name Register ADC_PWR2, field SPEEDA[1:0] (RW)
 *
 * These bits configure the clock speed at which the ADCA can operate. Faster
 * conversion speeds require greater current consumption.
 *
 * Values:
 * - 00 - Conversion clock frequency <= 6.25 MHz; current consumption per
 *     converter = 6 mA
 * - 01 - Conversion clock frequency <= 12.5 MHz; current consumption per
 *     converter = 10.8 mA
 * - 10 - Conversion clock frequency <= 18.75 MHz; current consumption per
 *     converter = 18 mA
 * - 11 - Conversion clock frequency <= 25 MHz; current consumption per
 *     converter = 25.2 mA
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR2_SPEEDA field. */
#define ADC_RD_PWR2_SPEEDA(base) ((ADC_PWR2_REG(base) & ADC_PWR2_SPEEDA_MASK) >> ADC_PWR2_SPEEDA_SHIFT)
#define ADC_BRD_PWR2_SPEEDA(base) (ADC_RD_PWR2_SPEEDA(base))

/*! @brief Set the SPEEDA field to a new value. */
#define ADC_WR_PWR2_SPEEDA(base, value) (ADC_RMW_PWR2(base, ADC_PWR2_SPEEDA_MASK, ADC_PWR2_SPEEDA(value)))
#define ADC_BWR_PWR2_SPEEDA(base, value) (ADC_WR_PWR2_SPEEDA(base, value))
/*@}*/

/*!
 * @name Register ADC_PWR2, field SPEEDB[3:2] (RW)
 *
 * These bits configure the clock speed at which the ADCB can operate. Faster
 * conversion speeds require greater current consumption.
 *
 * Values:
 * - 00 - Conversion clock frequency <= 6.25 MHz; current consumption per
 *     converter = 6 mA
 * - 01 - Conversion clock frequency <= 12.5 MHz; current consumption per
 *     converter = 10.8 mA
 * - 10 - Conversion clock frequency <= 18.75 MHz; current consumption per
 *     converter = 18 mA
 * - 11 - Conversion clock frequency <= 25 MHz; current consumption per
 *     converter = 25.2 mA
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR2_SPEEDB field. */
#define ADC_RD_PWR2_SPEEDB(base) ((ADC_PWR2_REG(base) & ADC_PWR2_SPEEDB_MASK) >> ADC_PWR2_SPEEDB_SHIFT)
#define ADC_BRD_PWR2_SPEEDB(base) (ADC_RD_PWR2_SPEEDB(base))

/*! @brief Set the SPEEDB field to a new value. */
#define ADC_WR_PWR2_SPEEDB(base, value) (ADC_RMW_PWR2(base, ADC_PWR2_SPEEDB_MASK, ADC_PWR2_SPEEDB(value)))
#define ADC_BWR_PWR2_SPEEDB(base, value) (ADC_WR_PWR2_SPEEDB(base, value))
/*@}*/

/*!
 * @name Register ADC_PWR2, field DIV1[13:8] (RW)
 *
 * The divider circuit operates in the same manner as the CTRL2[DIV0] field but
 * is used to generate the clock used by ADCB during parallel non-simultaneous
 * scan modes.
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR2_DIV1 field. */
#define ADC_RD_PWR2_DIV1(base) ((ADC_PWR2_REG(base) & ADC_PWR2_DIV1_MASK) >> ADC_PWR2_DIV1_SHIFT)
#define ADC_BRD_PWR2_DIV1(base) (ADC_RD_PWR2_DIV1(base))

