theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*! @brief Set the TRIG field to a new value. */
#define DMAMUX_WR_CHCFG_TRIG(base, index, value) (DMAMUX_RMW_CHCFG(base, index, DMAMUX_CHCFG_TRIG_MASK, DMAMUX_CHCFG_TRIG(value)))
#define DMAMUX_BWR_CHCFG_TRIG(base, index, value) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_TRIG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMAMUX_CHCFG, field ENBL[7] (RW)
 *
 * Enables the DMA channel.
 *
 * Values:
 * - 0 - DMA channel is disabled. This mode is primarily used during
 *     configuration of the DMAMux. The DMA has separate channel enables/disables, which
 *     should be used to disable or reconfigure a DMA channel.
 * - 1 - DMA channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMAMUX_CHCFG_ENBL field. */
#define DMAMUX_RD_CHCFG_ENBL(base, index) ((DMAMUX_CHCFG_REG(base, index) & DMAMUX_CHCFG_ENBL_MASK) >> DMAMUX_CHCFG_ENBL_SHIFT)
#define DMAMUX_BRD_CHCFG_ENBL(base, index) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_ENBL_SHIFT))

/*! @brief Set the ENBL field to a new value. */
#define DMAMUX_WR_CHCFG_ENBL(base, index, value) (DMAMUX_RMW_CHCFG(base, index, DMAMUX_CHCFG_ENBL_MASK, DMAMUX_CHCFG_ENBL(value)))
#define DMAMUX_BWR_CHCFG_ENBL(base, index, value) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_ENBL_SHIFT) = (value))
/*@}*/

/*
 * MKV40F15 ENC
 *
 * Quadrature Decoder
 *
 * Registers defined in this header file:
 * - ENC_CTRL - Control Register
 * - ENC_FILT - Input Filter Register
 * - ENC_WTR - Watchdog Timeout Register
 * - ENC_POSD - Position Difference Counter Register
 * - ENC_POSDH - Position Difference Hold Register
 * - ENC_REV - Revolution Counter Register
 * - ENC_REVH - Revolution Hold Register
 * - ENC_UPOS - Upper Position Counter Register
 * - ENC_LPOS - Lower Position Counter Register
 * - ENC_UPOSH - Upper Position Hold Register
 * - ENC_LPOSH - Lower Position Hold Register
 * - ENC_UINIT - Upper Initialization Register
 * - ENC_LINIT - Lower Initialization Register
 * - ENC_IMR - Input Monitor Register
 * - ENC_TST - Test Register
 * - ENC_CTRL2 - Control 2 Register
 * - ENC_UMOD - Upper Modulus Register
 * - ENC_LMOD - Lower Modulus Register
 * - ENC_UCOMP - Upper Position Compare Register
 * - ENC_LCOMP - Lower Position Compare Register
 */

#define ENC_INSTANCE_COUNT (1U) /*!< Number of instances of the ENC module. */
#define ENC_IDX (0U) /*!< Instance number for ENC. */

/*******************************************************************************
 * ENC_CTRL - Control Register
 ******************************************************************************/

/*!
 * @brief ENC_CTRL - Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_CTRL register
 */
/*@{*/
#define ENC_RD_CTRL(base)        (ENC_CTRL_REG(base))
#define ENC_WR_CTRL(base, value) (ENC_CTRL_REG(base) = (value))
#define ENC_RMW_CTRL(base, mask, value) (ENC_WR_CTRL(base, (ENC_RD_CTRL(base) & ~(mask)) | (value)))
#define ENC_SET_CTRL(base, value) (ENC_WR_CTRL(base, ENC_RD_CTRL(base) |  (value)))
#define ENC_CLR_CTRL(base, value) (ENC_WR_CTRL(base, ENC_RD_CTRL(base) & ~(value)))
#define ENC_TOG_CTRL(base, value) (ENC_WR_CTRL(base, ENC_RD_CTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENC_CTRL bitfields
 */

/*!
 * @name Register ENC_CTRL, field CMPIE[0] (RW)
 *
 * This read/write bit enables compare interrupts.
 *
 * Values:
 * - 0 - Compare interrupt is disabled
 * - 1 - Compare interrupt is enabled
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_CMPIE field. */
#define ENC_RD_CTRL_CMPIE(base) ((ENC_CTRL_REG(base) & ENC_CTRL_CMPIE_MASK) >> ENC_CTRL_CMPIE_SHIFT)
#define ENC_BRD_CTRL_CMPIE(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_CMPIE_SHIFT))

/*! @brief Set the CMPIE field to a new value. */
#define ENC_WR_CTRL_CMPIE(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_CMPIE_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_CMPIE(value)))
#define ENC_BWR_CTRL_CMPIE(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_CMPIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field CMPIRQ[1] (W1C)
 *
 * This bit is set when a match occurs between the counter and the COMP value.
 * It will remain set until cleared by software. Write a one to this bit to clear.
 *
 * Values:
 * - 0 - No match has occurred
 * - 1 - COMP match has occurred
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_CMPIRQ field. */
#define ENC_RD_CTRL_CMPIRQ(base) ((ENC_CTRL_REG(base) & ENC_CTRL_CMPIRQ_MASK) >> ENC_CTRL_CMPIRQ_SHIFT)
#define ENC_BRD_CTRL_CMPIRQ(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_CMPIRQ_SHIFT))

/*! @brief Set the CMPIRQ field to a new value. */
#define ENC_WR_CTRL_CMPIRQ(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_CMPIRQ(value)))
#define ENC_BWR_CTRL_CMPIRQ(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_CMPIRQ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field WDE[2] (RW)
 *
 * This bit allows operation of the watchdog timer monitoring the PHASEA and
 * PHASEB inputs for motor movement.
 *
 * Values:
 * - 0 - Watchdog timer is disabled
 * - 1 - Watchdog timer is enabled
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_WDE field. */
#define ENC_RD_CTRL_WDE(base) ((ENC_CTRL_REG(base) & ENC_CTRL_WDE_MASK) >> ENC_CTRL_WDE_SHIFT)
#define ENC_BRD_CTRL_WDE(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_WDE_SHIFT))

/*! @brief Set the WDE field to a new value. */
#define ENC_WR_CTRL_WDE(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_WDE_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_WDE(value)))
#define ENC_BWR_CTRL_WDE(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_WDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field DIE[3] (RW)
 *
 * This read/write bit enables watchdog timeout interrupts.
 *
 * Values:
 * - 0 - Watchdog timer interrupt is disabled
 * - 1 - Watchdog timer interrupt is enabled
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_DIE field. */
#define ENC_RD_CTRL_DIE(base) ((ENC_CTRL_REG(base) & ENC_CTRL_DIE_MASK) >> ENC_CTRL_DIE_SHIFT)
#define ENC_BRD_CTRL_DIE(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_DIE_SHIFT))

/*! @brief Set the DIE field to a new value. */
#define ENC_WR_CTRL_DIE(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_DIE_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_DIE(value)))
#define ENC_BWR_CTRL_DIE(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_DIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field DIRQ[4] (W1C)
 *
 * This bit is set when a watchdog timeout interrupt occurs. It will remain set
 * until cleared by software. Write a one to this bit to clear. This bit is also
 * cleared when CTRL[WDE] is 0.
 *
 * Values:
 * - 0 - No interrupt has occurred
 * - 1 - Watchdog timeout interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_DIRQ field. */
#define ENC_RD_CTRL_DIRQ(base) ((ENC_CTRL_REG(base) & ENC_CTRL_DIRQ_MASK) >> ENC_CTRL_DIRQ_SHIFT)
#define ENC_BRD_CTRL_DIRQ(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_DIRQ_SHIFT))

/*! @brief Set the DIRQ field to a new value. */
#define ENC_WR_CTRL_DIRQ(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_DIRQ_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_DIRQ(value)))
#define ENC_BWR_CTRL_DIRQ(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_DIRQ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field XNE[5] (RW)
 *
 * This read/write bit determines the edge of the INDEX pulse used to initialize
 * the position counter.
 *
 * Values:
 * - 0 - Use positive transition edge of INDEX pulse
 * - 1 - Use negative transition edge of INDEX pulse
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_XNE field. */
#define ENC_RD_CTRL_XNE(base) ((ENC_CTRL_REG(base) & ENC_CTRL_XNE_MASK) >> ENC_CTRL_XNE_SHIFT)
#define ENC_BRD_CTRL_XNE(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_XNE_SHIFT))

/*! @brief Set the XNE field to a new value. */
#define ENC_WR_CTRL_XNE(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_XNE_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_XNE(value)))
#define ENC_BWR_CTRL_XNE(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_XNE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field XIP[6] (RW)
 *
 * This read/write bit enables the position counter to be initialized by the
 * INDEX pulse.
 *
 * Values:
 * - 0 - No action
 * - 1 - INDEX pulse initializes the position counter
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_XIP field. */
#define ENC_RD_CTRL_XIP(base) ((ENC_CTRL_REG(base) & ENC_CTRL_XIP_MASK) >> ENC_CTRL_XIP_SHIFT)
#define ENC_BRD_CTRL_XIP(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_XIP_SHIFT))

/*! @brief Set the XIP field to a new value. */
#define ENC_WR_CTRL_XIP(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_XIP_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_XIP(value)))
#define ENC_BWR_CTRL_XIP(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_XIP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field XIE[7] (RW)
 *
 * This read/write bit enables index interrupts.
 *
 * Values:
 * - 0 - INDEX pulse interrupt is disabled
 * - 1 - INDEX pulse interrupt is enabled
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_XIE field. */
#define ENC_RD_CTRL_XIE(base) ((ENC_CTRL_REG(base) & ENC_CTRL_XIE_MASK) >> ENC_CTRL_XIE_SHIFT)
#define ENC_BRD_CTRL_XIE(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_XIE_SHIFT))

/*! @brief Set the XIE field to a new value. */
#define ENC_WR_CTRL_XIE(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_XIE_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_XIE(value)))
#define ENC_BWR_CTRL_XIE(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_XIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field XIRQ[8] (W1C)
 *
 * This bit is set when an INDEX interrupt occurs. It will remain set until
 * cleared by software. The clearing procedure is to write a one to this bit.
 *
 * Values:
 * - 0 - No interrupt has occurred
 * - 1 - INDEX pulse interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_XIRQ field. */
#define ENC_RD_CTRL_XIRQ(base) ((ENC_CTRL_REG(base) & ENC_CTRL_XIRQ_MASK) >> ENC_CTRL_XIRQ_SHIFT)
#define ENC_BRD_CTRL_XIRQ(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_XIRQ_SHIFT))

/*! @brief Set the XIRQ field to a new value. */
#define ENC_WR_CTRL_XIRQ(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_XIRQ_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_XIRQ(value)))
#define ENC_BWR_CTRL_XIRQ(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_XIRQ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field PH1[9] (RW)
 *
 * This read/write bit bypasses the quadrature decoder logic.
 *
 * Values:
 * - 0 - Use standard quadrature decoder where PHASEA and PHASEB represent a two
 *     phase quadrature signal.
 * - 1 - Bypass the quadrature decoder. A positive transition of the PHASEA
 *     input generates a count signal. The PHASEB input and the REV bit control the
 *     counter direction. If CTRL[REV] = 0, PHASEB = 0, then count up If CTRL[REV]
 *     = 0, PHASEB = 1, then count down If CTRL[REV] = 1, PHASEB = 0, then count
 *     down If CTRL[REV] = 1, PHASEB = 1, then count up
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_PH1 field. */
#define ENC_RD_CTRL_PH1(base) ((ENC_CTRL_REG(base) & ENC_CTRL_PH1_MASK) >> ENC_CTRL_PH1_SHIFT)
#define ENC_BRD_CTRL_PH1(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_PH1_SHIFT))

/*! @brief Set the PH1 field to a new value. */
#define ENC_WR_CTRL_PH1(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_PH1_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_PH1(value)))
#define ENC_BWR_CTRL_PH1(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_PH1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field REV[10] (RW)
 *
 * This read/write bit reverses the interpretation of the quadrature signal,
 * changing the direction of count.
 *
 * Values:
 * - 0 - Count normally
 * - 1 - Count in the reverse direction
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_REV field. */
#define ENC_RD_CTRL_REV(base) ((ENC_CTRL_REG(base) & ENC_CTRL_REV_MASK) >> ENC_CTRL_REV_SHIFT)
#define ENC_BRD_CTRL_REV(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_REV_SHIFT))

/*! @brief Set the REV field to a new value. */
#define ENC_WR_CTRL_REV(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_REV_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_REV(value)))
#define ENC_BWR_CTRL_REV(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_REV_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field SWIP[11] (WORZ)
 *
 * Writing a one to this bit will transfer the UINIT and LINIT contents to UPOS
 * and LPOS. This bit is always read as a zero.
 *
 * Values:
 * - 0 - No action
 * - 1 - Initialize position counter
 */
/*@{*/
/*! @brief Set the SWIP field to a new value. */
#define ENC_WR_CTRL_SWIP(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_SWIP_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_SWIP(value)))
#define ENC_BWR_CTRL_SWIP(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_SWIP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field HNE[12] (RW)
 *
 * This read/write bit determines whether to use the positive or negative edge
 * of the HOME input.
 *
 * Values:
 * - 0 - Use positive going edge-to-trigger initialization of position counters
 *     UPOS and LPOS
 * - 1 - Use negative going edge-to-trigger initialization of position counters
 *     UPOS and LPOS
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_HNE field. */
#define ENC_RD_CTRL_HNE(base) ((ENC_CTRL_REG(base) & ENC_CTRL_HNE_MASK) >> ENC_CTRL_HNE_SHIFT)
#define ENC_BRD_CTRL_HNE(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_HNE_SHIFT))

/*! @brief Set the HNE field to a new value. */
#define ENC_WR_CTRL_HNE(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_HNE_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_HNE(value)))
#define ENC_BWR_CTRL_HNE(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_HNE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field HIP[13] (RW)
 *
 * This read/write bit allows the position counter to be initialized by the HOME
 * signal.
 *
 * Values:
 * - 0 - No action
 * - 1 - HOME signal initializes the position counter
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_HIP field. */
#define ENC_RD_CTRL_HIP(base) ((ENC_CTRL_REG(base) & ENC_CTRL_HIP_MASK) >> ENC_CTRL_HIP_SHIFT)
#define ENC_BRD_CTRL_HIP(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_HIP_SHIFT))

/*! @brief Set the HIP field to a new value. */
#define ENC_WR_CTRL_HIP(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_HIP_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_HIP(value)))
#define ENC_BWR_CTRL_HIP(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_HIP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field HIE[14] (RW)
 *
 * This read/write bit enables HOME signal interrupts.
 *
 * Values:
 * - 0 - Disable HOME interrupts
 * - 1 - Enable HOME interrupts
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_HIE field. */
#define ENC_RD_CTRL_HIE(base) ((ENC_CTRL_REG(base) & ENC_CTRL_HIE_MASK) >> ENC_CTRL_HIE_SHIFT)
#define ENC_BRD_CTRL_HIE(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_HIE_SHIFT))

/*! @brief Set the HIE field to a new value. */
#define ENC_WR_CTRL_HIE(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_HIE_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK | ENC_CTRL_HIRQ_MASK), ENC_CTRL_HIE(value)))
#define ENC_BWR_CTRL_HIE(base, value) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_HIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENC_CTRL, field HIRQ[15] (W1C)
 *
 * This bit is set when a transition on the HOME signal occurs according to the
 * CTRL[HNE] bit. If this bit is set and CTRL[HIE] is set, a HOME interrupt
 * occurs. This bit will remain set until it is cleared by software. Write a one to
 * this bit to clear.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - HOME signal transition interrupt request
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL_HIRQ field. */
#define ENC_RD_CTRL_HIRQ(base) ((ENC_CTRL_REG(base) & ENC_CTRL_HIRQ_MASK) >> ENC_CTRL_HIRQ_SHIFT)
#define ENC_BRD_CTRL_HIRQ(base) (BITBAND_ACCESS16(&ENC_CTRL_REG(base), ENC_CTRL_HIRQ_SHIFT))

