theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*******************************************************************************
 * ENC_UMOD - Upper Modulus Register
 ******************************************************************************/

/*!
 * @brief ENC_UMOD - Upper Modulus Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_UMOD register
 */
/*@{*/
#define ENC_RD_UMOD(base)        (ENC_UMOD_REG(base))
#define ENC_WR_UMOD(base, value) (ENC_UMOD_REG(base) = (value))
#define ENC_RMW_UMOD(base, mask, value) (ENC_WR_UMOD(base, (ENC_RD_UMOD(base) & ~(mask)) | (value)))
#define ENC_SET_UMOD(base, value) (ENC_WR_UMOD(base, ENC_RD_UMOD(base) |  (value)))
#define ENC_CLR_UMOD(base, value) (ENC_WR_UMOD(base, ENC_RD_UMOD(base) & ~(value)))
#define ENC_TOG_UMOD(base, value) (ENC_WR_UMOD(base, ENC_RD_UMOD(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENC_LMOD - Lower Modulus Register
 ******************************************************************************/

/*!
 * @brief ENC_LMOD - Lower Modulus Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_LMOD register
 */
/*@{*/
#define ENC_RD_LMOD(base)        (ENC_LMOD_REG(base))
#define ENC_WR_LMOD(base, value) (ENC_LMOD_REG(base) = (value))
#define ENC_RMW_LMOD(base, mask, value) (ENC_WR_LMOD(base, (ENC_RD_LMOD(base) & ~(mask)) | (value)))
#define ENC_SET_LMOD(base, value) (ENC_WR_LMOD(base, ENC_RD_LMOD(base) |  (value)))
#define ENC_CLR_LMOD(base, value) (ENC_WR_LMOD(base, ENC_RD_LMOD(base) & ~(value)))
#define ENC_TOG_LMOD(base, value) (ENC_WR_LMOD(base, ENC_RD_LMOD(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENC_UCOMP - Upper Position Compare Register
 ******************************************************************************/

/*!
 * @brief ENC_UCOMP - Upper Position Compare Register (RW)
 *
 * Reset value: 0xFFFFU
 */
/*!
 * @name Constants and macros for entire ENC_UCOMP register
 */
/*@{*/
#define ENC_RD_UCOMP(base)       (ENC_UCOMP_REG(base))
#define ENC_WR_UCOMP(base, value) (ENC_UCOMP_REG(base) = (value))
#define ENC_RMW_UCOMP(base, mask, value) (ENC_WR_UCOMP(base, (ENC_RD_UCOMP(base) & ~(mask)) | (value)))
#define ENC_SET_UCOMP(base, value) (ENC_WR_UCOMP(base, ENC_RD_UCOMP(base) |  (value)))
#define ENC_CLR_UCOMP(base, value) (ENC_WR_UCOMP(base, ENC_RD_UCOMP(base) & ~(value)))
#define ENC_TOG_UCOMP(base, value) (ENC_WR_UCOMP(base, ENC_RD_UCOMP(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENC_LCOMP - Lower Position Compare Register
 ******************************************************************************/

/*!
 * @brief ENC_LCOMP - Lower Position Compare Register (RW)
 *
 * Reset value: 0xFFFFU
 */
/*!
 * @name Constants and macros for entire ENC_LCOMP register
 */
/*@{*/
#define ENC_RD_LCOMP(base)       (ENC_LCOMP_REG(base))
#define ENC_WR_LCOMP(base, value) (ENC_LCOMP_REG(base) = (value))
#define ENC_RMW_LCOMP(base, mask, value) (ENC_WR_LCOMP(base, (ENC_RD_LCOMP(base) & ~(mask)) | (value)))
#define ENC_SET_LCOMP(base, value) (ENC_WR_LCOMP(base, ENC_RD_LCOMP(base) |  (value)))
#define ENC_CLR_LCOMP(base, value) (ENC_WR_LCOMP(base, ENC_RD_LCOMP(base) & ~(value)))
#define ENC_TOG_LCOMP(base, value) (ENC_WR_LCOMP(base, ENC_RD_LCOMP(base) ^  (value)))
/*@}*/

/*
 * MKV40F15 EWM
 *
 * External Watchdog Monitor
 *
 * Registers defined in this header file:
 * - EWM_CTRL - Control Register
 * - EWM_SERV - Service Register
 * - EWM_CMPL - Compare Low Register
 * - EWM_CMPH - Compare High Register
 */

#define EWM_INSTANCE_COUNT (1U) /*!< Number of instances of the EWM module. */
#define EWM_IDX (0U) /*!< Instance number for EWM. */

/*******************************************************************************
 * EWM_CTRL - Control Register
 ******************************************************************************/

/*!
 * @brief EWM_CTRL - Control Register (RW)
 *
 * Reset value: 0x00U
 *
 * The CTRL register is cleared by any reset. INEN, ASSIN and EWMEN bits can be
 * written once after a CPU reset. Modifying these bits more than once, generates
 * a bus transfer error.
 */
/*!
 * @name Constants and macros for entire EWM_CTRL register
 */
/*@{*/
#define EWM_RD_CTRL(base)        (EWM_CTRL_REG(base))
#define EWM_WR_CTRL(base, value) (EWM_CTRL_REG(base) = (value))
#define EWM_RMW_CTRL(base, mask, value) (EWM_WR_CTRL(base, (EWM_RD_CTRL(base) & ~(mask)) | (value)))
#define EWM_SET_CTRL(base, value) (EWM_WR_CTRL(base, EWM_RD_CTRL(base) |  (value)))
#define EWM_CLR_CTRL(base, value) (EWM_WR_CTRL(base, EWM_RD_CTRL(base) & ~(value)))
#define EWM_TOG_CTRL(base, value) (EWM_WR_CTRL(base, EWM_RD_CTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual EWM_CTRL bitfields
 */

/*!
 * @name Register EWM_CTRL, field EWMEN[0] (RW)
 *
 * This bit when set, enables the EWM module. This resets the EWM counter to
 * zero and deasserts the EWM_out signal. Clearing EWMEN bit disables the EWM, and
 * therefore it cannot be enabled until a reset occurs, due to the write-once
 * nature of this bit.
 */
/*@{*/
/*! @brief Read current value of the EWM_CTRL_EWMEN field. */
#define EWM_RD_CTRL_EWMEN(base) ((EWM_CTRL_REG(base) & EWM_CTRL_EWMEN_MASK) >> EWM_CTRL_EWMEN_SHIFT)
#define EWM_BRD_CTRL_EWMEN(base) (BITBAND_ACCESS8(&EWM_CTRL_REG(base), EWM_CTRL_EWMEN_SHIFT))

/*! @brief Set the EWMEN field to a new value. */
#define EWM_WR_CTRL_EWMEN(base, value) (EWM_RMW_CTRL(base, EWM_CTRL_EWMEN_MASK, EWM_CTRL_EWMEN(value)))
#define EWM_BWR_CTRL_EWMEN(base, value) (BITBAND_ACCESS8(&EWM_CTRL_REG(base), EWM_CTRL_EWMEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register EWM_CTRL, field ASSIN[1] (RW)
 *
 * Default assert state of the EWM_in signal is logic zero. Setting ASSIN bit
 * inverts the assert state to a logic one.
 */
/*@{*/
/*! @brief Read current value of the EWM_CTRL_ASSIN field. */
#define EWM_RD_CTRL_ASSIN(base) ((EWM_CTRL_REG(base) & EWM_CTRL_ASSIN_MASK) >> EWM_CTRL_ASSIN_SHIFT)
#define EWM_BRD_CTRL_ASSIN(base) (BITBAND_ACCESS8(&EWM_CTRL_REG(base), EWM_CTRL_ASSIN_SHIFT))

/*! @brief Set the ASSIN field to a new value. */
#define EWM_WR_CTRL_ASSIN(base, value) (EWM_RMW_CTRL(base, EWM_CTRL_ASSIN_MASK, EWM_CTRL_ASSIN(value)))
#define EWM_BWR_CTRL_ASSIN(base, value) (BITBAND_ACCESS8(&EWM_CTRL_REG(base), EWM_CTRL_ASSIN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register EWM_CTRL, field INEN[2] (RW)
 *
 * This bit when set, enables the EWM_in port.
 */
/*@{*/
/*! @brief Read current value of the EWM_CTRL_INEN field. */
#define EWM_RD_CTRL_INEN(base) ((EWM_CTRL_REG(base) & EWM_CTRL_INEN_MASK) >> EWM_CTRL_INEN_SHIFT)
#define EWM_BRD_CTRL_INEN(base) (BITBAND_ACCESS8(&EWM_CTRL_REG(base), EWM_CTRL_INEN_SHIFT))

/*! @brief Set the INEN field to a new value. */
#define EWM_WR_CTRL_INEN(base, value) (EWM_RMW_CTRL(base, EWM_CTRL_INEN_MASK, EWM_CTRL_INEN(value)))
#define EWM_BWR_CTRL_INEN(base, value) (BITBAND_ACCESS8(&EWM_CTRL_REG(base), EWM_CTRL_INEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register EWM_CTRL, field INTEN[3] (RW)
 *
 * This bit when set and EWM_out is asserted, an interrupt request is generated.
 * To de-assert interrupt request, user should clear this bit by writing 0.
 */
/*@{*/
/*! @brief Read current value of the EWM_CTRL_INTEN field. */
#define EWM_RD_CTRL_INTEN(base) ((EWM_CTRL_REG(base) & EWM_CTRL_INTEN_MASK) >> EWM_CTRL_INTEN_SHIFT)
#define EWM_BRD_CTRL_INTEN(base) (BITBAND_ACCESS8(&EWM_CTRL_REG(base), EWM_CTRL_INTEN_SHIFT))

