theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*******************************************************************************
 * SIM_SOPT5 - System Options Register 5
 ******************************************************************************/

/*!
 * @brief SIM_SOPT5 - System Options Register 5 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT5 register
 */
/*@{*/
#define SIM_RD_SOPT5(base)       (SIM_SOPT5_REG(base))
#define SIM_WR_SOPT5(base, value) (SIM_SOPT5_REG(base) = (value))
#define SIM_RMW_SOPT5(base, mask, value) (SIM_WR_SOPT5(base, (SIM_RD_SOPT5(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT5(base, value) (SIM_WR_SOPT5(base, SIM_RD_SOPT5(base) |  (value)))
#define SIM_CLR_SOPT5(base, value) (SIM_WR_SOPT5(base, SIM_RD_SOPT5(base) & ~(value)))
#define SIM_TOG_SOPT5(base, value) (SIM_WR_SOPT5(base, SIM_RD_SOPT5(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT5 bitfields
 */

/*!
 * @name Register SIM_SOPT5, field UART0TXSRC[0] (RW)
 *
 * Selects the source for the UART 0 transmit data.
 *
 * Values:
 * - 0 - UART0_TX pin
 * - 1 - UART0_TX pin modulated with FTM1 channel 0 output
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART0TXSRC field. */
#define SIM_RD_SOPT5_UART0TXSRC(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART0TXSRC_MASK) >> SIM_SOPT5_UART0TXSRC_SHIFT)
#define SIM_BRD_SOPT5_UART0TXSRC(base) (BITBAND_ACCESS32(&SIM_SOPT5_REG(base), SIM_SOPT5_UART0TXSRC_SHIFT))

/*! @brief Set the UART0TXSRC field to a new value. */
#define SIM_WR_SOPT5_UART0TXSRC(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART0TXSRC_MASK, SIM_SOPT5_UART0TXSRC(value)))
#define SIM_BWR_SOPT5_UART0TXSRC(base, value) (BITBAND_ACCESS32(&SIM_SOPT5_REG(base), SIM_SOPT5_UART0TXSRC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field UART0RXSRC[3:2] (RW)
 *
 * Selects the source for the UART 0 receive data.
 *
 * Values:
 * - 00 - UART0_RX pin
 * - 01 - CMP0
 * - 10 - CMP1
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART0RXSRC field. */
#define SIM_RD_SOPT5_UART0RXSRC(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART0RXSRC_MASK) >> SIM_SOPT5_UART0RXSRC_SHIFT)
#define SIM_BRD_SOPT5_UART0RXSRC(base) (SIM_RD_SOPT5_UART0RXSRC(base))

/*! @brief Set the UART0RXSRC field to a new value. */
#define SIM_WR_SOPT5_UART0RXSRC(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART0RXSRC_MASK, SIM_SOPT5_UART0RXSRC(value)))
#define SIM_BWR_SOPT5_UART0RXSRC(base, value) (SIM_WR_SOPT5_UART0RXSRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field UART1TXSRC[4] (RW)
 *
 * Selects the source for the UART 1 transmit data.
 *
 * Values:
 * - 0 - UART1_TX pin
 * - 1 - UART1_TX pin modulated with FTM1 channel 0 output
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART1TXSRC field. */
#define SIM_RD_SOPT5_UART1TXSRC(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART1TXSRC_MASK) >> SIM_SOPT5_UART1TXSRC_SHIFT)
#define SIM_BRD_SOPT5_UART1TXSRC(base) (BITBAND_ACCESS32(&SIM_SOPT5_REG(base), SIM_SOPT5_UART1TXSRC_SHIFT))

/*! @brief Set the UART1TXSRC field to a new value. */
#define SIM_WR_SOPT5_UART1TXSRC(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART1TXSRC_MASK, SIM_SOPT5_UART1TXSRC(value)))
#define SIM_BWR_SOPT5_UART1TXSRC(base, value) (BITBAND_ACCESS32(&SIM_SOPT5_REG(base), SIM_SOPT5_UART1TXSRC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field UART1RXSRC[7:6] (RW)
 *
 * Selects the source for the UART 1 receive data.
 *
 * Values:
 * - 00 - UART1_RX pin
 * - 01 - CMP0
 * - 10 - CMP1
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART1RXSRC field. */
#define SIM_RD_SOPT5_UART1RXSRC(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART1RXSRC_MASK) >> SIM_SOPT5_UART1RXSRC_SHIFT)
#define SIM_BRD_SOPT5_UART1RXSRC(base) (SIM_RD_SOPT5_UART1RXSRC(base))

/*! @brief Set the UART1RXSRC field to a new value. */
#define SIM_WR_SOPT5_UART1RXSRC(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART1RXSRC_MASK, SIM_SOPT5_UART1RXSRC(value)))
#define SIM_BWR_SOPT5_UART1RXSRC(base, value) (SIM_WR_SOPT5_UART1RXSRC(base, value))
/*@}*/

/*******************************************************************************
 * SIM_SOPT7 - System Options Register 7
 ******************************************************************************/

/*!
 * @brief SIM_SOPT7 - System Options Register 7 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT7 register
 */
/*@{*/
#define SIM_RD_SOPT7(base)       (SIM_SOPT7_REG(base))
#define SIM_WR_SOPT7(base, value) (SIM_SOPT7_REG(base) = (value))
#define SIM_RMW_SOPT7(base, mask, value) (SIM_WR_SOPT7(base, (SIM_RD_SOPT7(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT7(base, value) (SIM_WR_SOPT7(base, SIM_RD_SOPT7(base) |  (value)))
#define SIM_CLR_SOPT7(base, value) (SIM_WR_SOPT7(base, SIM_RD_SOPT7(base) & ~(value)))
#define SIM_TOG_SOPT7(base, value) (SIM_WR_SOPT7(base, SIM_RD_SOPT7(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT7 bitfields
 */

/*!
 * @name Register SIM_SOPT7, field ADCATRGSEL[3:0] (RW)
 *
 * Selects the ADCA trigger source when alternative triggers are functional in
 * stop and VLPS modes. .
 *
 * Values:
 * - 0000 - PDB external trigger pin input (PDB0_EXTRG)
 * - 0001 - High speed comparator 0 output
 * - 0010 - High speed comparator 1 output
 * - 0011 - High speed comparator 2 output
 * - 0100 - PIT trigger 0
 * - 0101 - PIT trigger 1
 * - 0110 - PIT trigger 2
 * - 0111 - PIT trigger 3
 * - 1000 - FTM0 trigger
 * - 1001 - FTM1 trigger
 * - 1010 - Reserved
 * - 1011 - FTM3 trigger
 * - 1100 - XBARA output 38
 * - 1101 - Reserved
 * - 1110 - Low-power timer trigger
 * - 1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADCATRGSEL field. */
#define SIM_RD_SOPT7_ADCATRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADCATRGSEL_MASK) >> SIM_SOPT7_ADCATRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADCATRGSEL(base) (SIM_RD_SOPT7_ADCATRGSEL(base))

/*! @brief Set the ADCATRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADCATRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADCATRGSEL_MASK, SIM_SOPT7_ADCATRGSEL(value)))
#define SIM_BWR_SOPT7_ADCATRGSEL(base, value) (SIM_WR_SOPT7_ADCATRGSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADCAALTTRGEN[7:6] (RW)
 *
 * Enable alternative conversion triggers for ADCA.
 *
 * Values:
 * - 00 - XBARA output 12.
 * - 01 - PDB0 trigger selected for ADCA.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADCAALTTRGEN field. */
#define SIM_RD_SOPT7_ADCAALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADCAALTTRGEN_MASK) >> SIM_SOPT7_ADCAALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADCAALTTRGEN(base) (SIM_RD_SOPT7_ADCAALTTRGEN(base))

/*! @brief Set the ADCAALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADCAALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADCAALTTRGEN_MASK, SIM_SOPT7_ADCAALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADCAALTTRGEN(base, value) (SIM_WR_SOPT7_ADCAALTTRGEN(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADCBTRGSEL[11:8] (RW)
 *
 * Selects the ADCB trigger source when alternative triggers are functional in
 * stop and VLPS modes.
 *
 * Values:
 * - 0000 - Reserved
 * - 0001 - High speed comparator 0 output
 * - 0010 - High speed comparator 1 output
 * - 0011 - High speed comparator 2 output
 * - 0100 - PIT trigger 0
 * - 0101 - PIT trigger 1
 * - 0110 - PIT trigger 2
 * - 0111 - PIT trigger 3
 * - 1000 - FTM0 trigger
 * - 1001 - FTM1 trigger
 * - 1010 - Reserved
 * - 1011 - FTM3 trigger
 * - 1100 - XBARA output 41
 * - 1101 - Reserved
 * - 1110 - Low-power timer trigger
 * - 1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADCBTRGSEL field. */
#define SIM_RD_SOPT7_ADCBTRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADCBTRGSEL_MASK) >> SIM_SOPT7_ADCBTRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADCBTRGSEL(base) (SIM_RD_SOPT7_ADCBTRGSEL(base))

