theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*******************************************************************************
 * XBARA_SEL2 - Crossbar A Select Register 2
 ******************************************************************************/

/*!
 * @brief XBARA_SEL2 - Crossbar A Select Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL2 register
 */
/*@{*/
#define XBARA_RD_SEL2(base)      (XBARA_SEL2_REG(base))
#define XBARA_WR_SEL2(base, value) (XBARA_SEL2_REG(base) = (value))
#define XBARA_RMW_SEL2(base, mask, value) (XBARA_WR_SEL2(base, (XBARA_RD_SEL2(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL2(base, value) (XBARA_WR_SEL2(base, XBARA_RD_SEL2(base) |  (value)))
#define XBARA_CLR_SEL2(base, value) (XBARA_WR_SEL2(base, XBARA_RD_SEL2(base) & ~(value)))
#define XBARA_TOG_SEL2(base, value) (XBARA_WR_SEL2(base, XBARA_RD_SEL2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL2 bitfields
 */

/*!
 * @name Register XBARA_SEL2, field SEL4[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT4 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL2_SEL4 field. */
#define XBARA_RD_SEL2_SEL4(base) ((XBARA_SEL2_REG(base) & XBARA_SEL2_SEL4_MASK) >> XBARA_SEL2_SEL4_SHIFT)
#define XBARA_BRD_SEL2_SEL4(base) (XBARA_RD_SEL2_SEL4(base))

/*! @brief Set the SEL4 field to a new value. */
#define XBARA_WR_SEL2_SEL4(base, value) (XBARA_RMW_SEL2(base, XBARA_SEL2_SEL4_MASK, XBARA_SEL2_SEL4(value)))
#define XBARA_BWR_SEL2_SEL4(base, value) (XBARA_WR_SEL2_SEL4(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL2, field SEL5[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT5 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL2_SEL5 field. */
#define XBARA_RD_SEL2_SEL5(base) ((XBARA_SEL2_REG(base) & XBARA_SEL2_SEL5_MASK) >> XBARA_SEL2_SEL5_SHIFT)
#define XBARA_BRD_SEL2_SEL5(base) (XBARA_RD_SEL2_SEL5(base))

/*! @brief Set the SEL5 field to a new value. */
#define XBARA_WR_SEL2_SEL5(base, value) (XBARA_RMW_SEL2(base, XBARA_SEL2_SEL5_MASK, XBARA_SEL2_SEL5(value)))
#define XBARA_BWR_SEL2_SEL5(base, value) (XBARA_WR_SEL2_SEL5(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL3 - Crossbar A Select Register 3
 ******************************************************************************/

/*!
 * @brief XBARA_SEL3 - Crossbar A Select Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL3 register
 */
/*@{*/
#define XBARA_RD_SEL3(base)      (XBARA_SEL3_REG(base))
#define XBARA_WR_SEL3(base, value) (XBARA_SEL3_REG(base) = (value))
#define XBARA_RMW_SEL3(base, mask, value) (XBARA_WR_SEL3(base, (XBARA_RD_SEL3(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL3(base, value) (XBARA_WR_SEL3(base, XBARA_RD_SEL3(base) |  (value)))
#define XBARA_CLR_SEL3(base, value) (XBARA_WR_SEL3(base, XBARA_RD_SEL3(base) & ~(value)))
#define XBARA_TOG_SEL3(base, value) (XBARA_WR_SEL3(base, XBARA_RD_SEL3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL3 bitfields
 */

/*!
 * @name Register XBARA_SEL3, field SEL6[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT6 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL3_SEL6 field. */
#define XBARA_RD_SEL3_SEL6(base) ((XBARA_SEL3_REG(base) & XBARA_SEL3_SEL6_MASK) >> XBARA_SEL3_SEL6_SHIFT)
#define XBARA_BRD_SEL3_SEL6(base) (XBARA_RD_SEL3_SEL6(base))

/*! @brief Set the SEL6 field to a new value. */
#define XBARA_WR_SEL3_SEL6(base, value) (XBARA_RMW_SEL3(base, XBARA_SEL3_SEL6_MASK, XBARA_SEL3_SEL6(value)))
#define XBARA_BWR_SEL3_SEL6(base, value) (XBARA_WR_SEL3_SEL6(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL3, field SEL7[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT7 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL3_SEL7 field. */
#define XBARA_RD_SEL3_SEL7(base) ((XBARA_SEL3_REG(base) & XBARA_SEL3_SEL7_MASK) >> XBARA_SEL3_SEL7_SHIFT)
#define XBARA_BRD_SEL3_SEL7(base) (XBARA_RD_SEL3_SEL7(base))

/*! @brief Set the SEL7 field to a new value. */
#define XBARA_WR_SEL3_SEL7(base, value) (XBARA_RMW_SEL3(base, XBARA_SEL3_SEL7_MASK, XBARA_SEL3_SEL7(value)))
#define XBARA_BWR_SEL3_SEL7(base, value) (XBARA_WR_SEL3_SEL7(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL4 - Crossbar A Select Register 4
 ******************************************************************************/

/*!
 * @brief XBARA_SEL4 - Crossbar A Select Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL4 register
 */
/*@{*/
#define XBARA_RD_SEL4(base)      (XBARA_SEL4_REG(base))
#define XBARA_WR_SEL4(base, value) (XBARA_SEL4_REG(base) = (value))
#define XBARA_RMW_SEL4(base, mask, value) (XBARA_WR_SEL4(base, (XBARA_RD_SEL4(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL4(base, value) (XBARA_WR_SEL4(base, XBARA_RD_SEL4(base) |  (value)))
#define XBARA_CLR_SEL4(base, value) (XBARA_WR_SEL4(base, XBARA_RD_SEL4(base) & ~(value)))
#define XBARA_TOG_SEL4(base, value) (XBARA_WR_SEL4(base, XBARA_RD_SEL4(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL4 bitfields
 */

/*!
 * @name Register XBARA_SEL4, field SEL8[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT8 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL4_SEL8 field. */
#define XBARA_RD_SEL4_SEL8(base) ((XBARA_SEL4_REG(base) & XBARA_SEL4_SEL8_MASK) >> XBARA_SEL4_SEL8_SHIFT)
#define XBARA_BRD_SEL4_SEL8(base) (XBARA_RD_SEL4_SEL8(base))

/*! @brief Set the SEL8 field to a new value. */
#define XBARA_WR_SEL4_SEL8(base, value) (XBARA_RMW_SEL4(base, XBARA_SEL4_SEL8_MASK, XBARA_SEL4_SEL8(value)))
#define XBARA_BWR_SEL4_SEL8(base, value) (XBARA_WR_SEL4_SEL8(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL4, field SEL9[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT9 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL4_SEL9 field. */
#define XBARA_RD_SEL4_SEL9(base) ((XBARA_SEL4_REG(base) & XBARA_SEL4_SEL9_MASK) >> XBARA_SEL4_SEL9_SHIFT)
#define XBARA_BRD_SEL4_SEL9(base) (XBARA_RD_SEL4_SEL9(base))

/*! @brief Set the SEL9 field to a new value. */
#define XBARA_WR_SEL4_SEL9(base, value) (XBARA_RMW_SEL4(base, XBARA_SEL4_SEL9_MASK, XBARA_SEL4_SEL9(value)))
#define XBARA_BWR_SEL4_SEL9(base, value) (XBARA_WR_SEL4_SEL9(base, value))
/*@}*/

