theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*! @brief Set the SEL27 field to a new value. */
#define XBARA_WR_SEL13_SEL27(base, value) (XBARA_RMW_SEL13(base, XBARA_SEL13_SEL27_MASK, XBARA_SEL13_SEL27(value)))
#define XBARA_BWR_SEL13_SEL27(base, value) (XBARA_WR_SEL13_SEL27(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL14 - Crossbar A Select Register 14
 ******************************************************************************/

/*!
 * @brief XBARA_SEL14 - Crossbar A Select Register 14 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL14 register
 */
/*@{*/
#define XBARA_RD_SEL14(base)     (XBARA_SEL14_REG(base))
#define XBARA_WR_SEL14(base, value) (XBARA_SEL14_REG(base) = (value))
#define XBARA_RMW_SEL14(base, mask, value) (XBARA_WR_SEL14(base, (XBARA_RD_SEL14(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL14(base, value) (XBARA_WR_SEL14(base, XBARA_RD_SEL14(base) |  (value)))
#define XBARA_CLR_SEL14(base, value) (XBARA_WR_SEL14(base, XBARA_RD_SEL14(base) & ~(value)))
#define XBARA_TOG_SEL14(base, value) (XBARA_WR_SEL14(base, XBARA_RD_SEL14(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL14 bitfields
 */

/*!
 * @name Register XBARA_SEL14, field SEL28[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT28 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL14_SEL28 field. */
#define XBARA_RD_SEL14_SEL28(base) ((XBARA_SEL14_REG(base) & XBARA_SEL14_SEL28_MASK) >> XBARA_SEL14_SEL28_SHIFT)
#define XBARA_BRD_SEL14_SEL28(base) (XBARA_RD_SEL14_SEL28(base))

/*! @brief Set the SEL28 field to a new value. */
#define XBARA_WR_SEL14_SEL28(base, value) (XBARA_RMW_SEL14(base, XBARA_SEL14_SEL28_MASK, XBARA_SEL14_SEL28(value)))
#define XBARA_BWR_SEL14_SEL28(base, value) (XBARA_WR_SEL14_SEL28(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL14, field SEL29[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT29 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL14_SEL29 field. */
#define XBARA_RD_SEL14_SEL29(base) ((XBARA_SEL14_REG(base) & XBARA_SEL14_SEL29_MASK) >> XBARA_SEL14_SEL29_SHIFT)
#define XBARA_BRD_SEL14_SEL29(base) (XBARA_RD_SEL14_SEL29(base))

/*! @brief Set the SEL29 field to a new value. */
#define XBARA_WR_SEL14_SEL29(base, value) (XBARA_RMW_SEL14(base, XBARA_SEL14_SEL29_MASK, XBARA_SEL14_SEL29(value)))
#define XBARA_BWR_SEL14_SEL29(base, value) (XBARA_WR_SEL14_SEL29(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL15 - Crossbar A Select Register 15
 ******************************************************************************/

/*!
 * @brief XBARA_SEL15 - Crossbar A Select Register 15 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL15 register
 */
/*@{*/
#define XBARA_RD_SEL15(base)     (XBARA_SEL15_REG(base))
#define XBARA_WR_SEL15(base, value) (XBARA_SEL15_REG(base) = (value))
#define XBARA_RMW_SEL15(base, mask, value) (XBARA_WR_SEL15(base, (XBARA_RD_SEL15(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL15(base, value) (XBARA_WR_SEL15(base, XBARA_RD_SEL15(base) |  (value)))
#define XBARA_CLR_SEL15(base, value) (XBARA_WR_SEL15(base, XBARA_RD_SEL15(base) & ~(value)))
#define XBARA_TOG_SEL15(base, value) (XBARA_WR_SEL15(base, XBARA_RD_SEL15(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL15 bitfields
 */

/*!
 * @name Register XBARA_SEL15, field SEL30[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT30 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL15_SEL30 field. */
#define XBARA_RD_SEL15_SEL30(base) ((XBARA_SEL15_REG(base) & XBARA_SEL15_SEL30_MASK) >> XBARA_SEL15_SEL30_SHIFT)
#define XBARA_BRD_SEL15_SEL30(base) (XBARA_RD_SEL15_SEL30(base))

/*! @brief Set the SEL30 field to a new value. */
#define XBARA_WR_SEL15_SEL30(base, value) (XBARA_RMW_SEL15(base, XBARA_SEL15_SEL30_MASK, XBARA_SEL15_SEL30(value)))
#define XBARA_BWR_SEL15_SEL30(base, value) (XBARA_WR_SEL15_SEL30(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL15, field SEL31[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT31 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL15_SEL31 field. */
#define XBARA_RD_SEL15_SEL31(base) ((XBARA_SEL15_REG(base) & XBARA_SEL15_SEL31_MASK) >> XBARA_SEL15_SEL31_SHIFT)
#define XBARA_BRD_SEL15_SEL31(base) (XBARA_RD_SEL15_SEL31(base))

/*! @brief Set the SEL31 field to a new value. */
#define XBARA_WR_SEL15_SEL31(base, value) (XBARA_RMW_SEL15(base, XBARA_SEL15_SEL31_MASK, XBARA_SEL15_SEL31(value)))
#define XBARA_BWR_SEL15_SEL31(base, value) (XBARA_WR_SEL15_SEL31(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL16 - Crossbar A Select Register 16
 ******************************************************************************/

/*!
 * @brief XBARA_SEL16 - Crossbar A Select Register 16 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL16 register
 */
/*@{*/
#define XBARA_RD_SEL16(base)     (XBARA_SEL16_REG(base))
#define XBARA_WR_SEL16(base, value) (XBARA_SEL16_REG(base) = (value))
#define XBARA_RMW_SEL16(base, mask, value) (XBARA_WR_SEL16(base, (XBARA_RD_SEL16(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL16(base, value) (XBARA_WR_SEL16(base, XBARA_RD_SEL16(base) |  (value)))
#define XBARA_CLR_SEL16(base, value) (XBARA_WR_SEL16(base, XBARA_RD_SEL16(base) & ~(value)))
#define XBARA_TOG_SEL16(base, value) (XBARA_WR_SEL16(base, XBARA_RD_SEL16(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL16 bitfields
 */

/*!
 * @name Register XBARA_SEL16, field SEL32[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT32 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL16_SEL32 field. */
#define XBARA_RD_SEL16_SEL32(base) ((XBARA_SEL16_REG(base) & XBARA_SEL16_SEL32_MASK) >> XBARA_SEL16_SEL32_SHIFT)
#define XBARA_BRD_SEL16_SEL32(base) (XBARA_RD_SEL16_SEL32(base))

