theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*******************************************************************************
 * XBARA_SEL25 - Crossbar A Select Register 25
 ******************************************************************************/

/*!
 * @brief XBARA_SEL25 - Crossbar A Select Register 25 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL25 register
 */
/*@{*/
#define XBARA_RD_SEL25(base)     (XBARA_SEL25_REG(base))
#define XBARA_WR_SEL25(base, value) (XBARA_SEL25_REG(base) = (value))
#define XBARA_RMW_SEL25(base, mask, value) (XBARA_WR_SEL25(base, (XBARA_RD_SEL25(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL25(base, value) (XBARA_WR_SEL25(base, XBARA_RD_SEL25(base) |  (value)))
#define XBARA_CLR_SEL25(base, value) (XBARA_WR_SEL25(base, XBARA_RD_SEL25(base) & ~(value)))
#define XBARA_TOG_SEL25(base, value) (XBARA_WR_SEL25(base, XBARA_RD_SEL25(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL25 bitfields
 */

/*!
 * @name Register XBARA_SEL25, field SEL50[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT50 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL25_SEL50 field. */
#define XBARA_RD_SEL25_SEL50(base) ((XBARA_SEL25_REG(base) & XBARA_SEL25_SEL50_MASK) >> XBARA_SEL25_SEL50_SHIFT)
#define XBARA_BRD_SEL25_SEL50(base) (XBARA_RD_SEL25_SEL50(base))

/*! @brief Set the SEL50 field to a new value. */
#define XBARA_WR_SEL25_SEL50(base, value) (XBARA_RMW_SEL25(base, XBARA_SEL25_SEL50_MASK, XBARA_SEL25_SEL50(value)))
#define XBARA_BWR_SEL25_SEL50(base, value) (XBARA_WR_SEL25_SEL50(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL25, field SEL51[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT51 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL25_SEL51 field. */
#define XBARA_RD_SEL25_SEL51(base) ((XBARA_SEL25_REG(base) & XBARA_SEL25_SEL51_MASK) >> XBARA_SEL25_SEL51_SHIFT)
#define XBARA_BRD_SEL25_SEL51(base) (XBARA_RD_SEL25_SEL51(base))

/*! @brief Set the SEL51 field to a new value. */
#define XBARA_WR_SEL25_SEL51(base, value) (XBARA_RMW_SEL25(base, XBARA_SEL25_SEL51_MASK, XBARA_SEL25_SEL51(value)))
#define XBARA_BWR_SEL25_SEL51(base, value) (XBARA_WR_SEL25_SEL51(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL26 - Crossbar A Select Register 26
 ******************************************************************************/

/*!
 * @brief XBARA_SEL26 - Crossbar A Select Register 26 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL26 register
 */
/*@{*/
#define XBARA_RD_SEL26(base)     (XBARA_SEL26_REG(base))
#define XBARA_WR_SEL26(base, value) (XBARA_SEL26_REG(base) = (value))
#define XBARA_RMW_SEL26(base, mask, value) (XBARA_WR_SEL26(base, (XBARA_RD_SEL26(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL26(base, value) (XBARA_WR_SEL26(base, XBARA_RD_SEL26(base) |  (value)))
#define XBARA_CLR_SEL26(base, value) (XBARA_WR_SEL26(base, XBARA_RD_SEL26(base) & ~(value)))
#define XBARA_TOG_SEL26(base, value) (XBARA_WR_SEL26(base, XBARA_RD_SEL26(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL26 bitfields
 */

/*!
 * @name Register XBARA_SEL26, field SEL52[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT52 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL26_SEL52 field. */
#define XBARA_RD_SEL26_SEL52(base) ((XBARA_SEL26_REG(base) & XBARA_SEL26_SEL52_MASK) >> XBARA_SEL26_SEL52_SHIFT)
#define XBARA_BRD_SEL26_SEL52(base) (XBARA_RD_SEL26_SEL52(base))

/*! @brief Set the SEL52 field to a new value. */
#define XBARA_WR_SEL26_SEL52(base, value) (XBARA_RMW_SEL26(base, XBARA_SEL26_SEL52_MASK, XBARA_SEL26_SEL52(value)))
#define XBARA_BWR_SEL26_SEL52(base, value) (XBARA_WR_SEL26_SEL52(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL26, field SEL53[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT53 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL26_SEL53 field. */
#define XBARA_RD_SEL26_SEL53(base) ((XBARA_SEL26_REG(base) & XBARA_SEL26_SEL53_MASK) >> XBARA_SEL26_SEL53_SHIFT)
#define XBARA_BRD_SEL26_SEL53(base) (XBARA_RD_SEL26_SEL53(base))

/*! @brief Set the SEL53 field to a new value. */
#define XBARA_WR_SEL26_SEL53(base, value) (XBARA_RMW_SEL26(base, XBARA_SEL26_SEL53_MASK, XBARA_SEL26_SEL53(value)))
#define XBARA_BWR_SEL26_SEL53(base, value) (XBARA_WR_SEL26_SEL53(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL27 - Crossbar A Select Register 27
 ******************************************************************************/

/*!
 * @brief XBARA_SEL27 - Crossbar A Select Register 27 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL27 register
 */
/*@{*/
#define XBARA_RD_SEL27(base)     (XBARA_SEL27_REG(base))
#define XBARA_WR_SEL27(base, value) (XBARA_SEL27_REG(base) = (value))
#define XBARA_RMW_SEL27(base, mask, value) (XBARA_WR_SEL27(base, (XBARA_RD_SEL27(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL27(base, value) (XBARA_WR_SEL27(base, XBARA_RD_SEL27(base) |  (value)))
#define XBARA_CLR_SEL27(base, value) (XBARA_WR_SEL27(base, XBARA_RD_SEL27(base) & ~(value)))
#define XBARA_TOG_SEL27(base, value) (XBARA_WR_SEL27(base, XBARA_RD_SEL27(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL27 bitfields
 */

/*!
 * @name Register XBARA_SEL27, field SEL54[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT54 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL27_SEL54 field. */
#define XBARA_RD_SEL27_SEL54(base) ((XBARA_SEL27_REG(base) & XBARA_SEL27_SEL54_MASK) >> XBARA_SEL27_SEL54_SHIFT)
#define XBARA_BRD_SEL27_SEL54(base) (XBARA_RD_SEL27_SEL54(base))

/*! @brief Set the SEL54 field to a new value. */
#define XBARA_WR_SEL27_SEL54(base, value) (XBARA_RMW_SEL27(base, XBARA_SEL27_SEL54_MASK, XBARA_SEL27_SEL54(value)))
#define XBARA_BWR_SEL27_SEL54(base, value) (XBARA_WR_SEL27_SEL54(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL27, field SEL55[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT55 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL27_SEL55 field. */
#define XBARA_RD_SEL27_SEL55(base) ((XBARA_SEL27_REG(base) & XBARA_SEL27_SEL55_MASK) >> XBARA_SEL27_SEL55_SHIFT)
#define XBARA_BRD_SEL27_SEL55(base) (XBARA_RD_SEL27_SEL55(base))

/*! @brief Set the SEL55 field to a new value. */
#define XBARA_WR_SEL27_SEL55(base, value) (XBARA_RMW_SEL27(base, XBARA_SEL27_SEL55_MASK, XBARA_SEL27_SEL55(value)))
#define XBARA_BWR_SEL27_SEL55(base, value) (XBARA_WR_SEL27_SEL55(base, value))
/*@}*/

