theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*******************************************************************************
 * XBARA_SEL28 - Crossbar A Select Register 28
 ******************************************************************************/

/*!
 * @brief XBARA_SEL28 - Crossbar A Select Register 28 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL28 register
 */
/*@{*/
#define XBARA_RD_SEL28(base)     (XBARA_SEL28_REG(base))
#define XBARA_WR_SEL28(base, value) (XBARA_SEL28_REG(base) = (value))
#define XBARA_RMW_SEL28(base, mask, value) (XBARA_WR_SEL28(base, (XBARA_RD_SEL28(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL28(base, value) (XBARA_WR_SEL28(base, XBARA_RD_SEL28(base) |  (value)))
#define XBARA_CLR_SEL28(base, value) (XBARA_WR_SEL28(base, XBARA_RD_SEL28(base) & ~(value)))
#define XBARA_TOG_SEL28(base, value) (XBARA_WR_SEL28(base, XBARA_RD_SEL28(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL28 bitfields
 */

/*!
 * @name Register XBARA_SEL28, field SEL56[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT56 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL28_SEL56 field. */
#define XBARA_RD_SEL28_SEL56(base) ((XBARA_SEL28_REG(base) & XBARA_SEL28_SEL56_MASK) >> XBARA_SEL28_SEL56_SHIFT)
#define XBARA_BRD_SEL28_SEL56(base) (XBARA_RD_SEL28_SEL56(base))

/*! @brief Set the SEL56 field to a new value. */
#define XBARA_WR_SEL28_SEL56(base, value) (XBARA_RMW_SEL28(base, XBARA_SEL28_SEL56_MASK, XBARA_SEL28_SEL56(value)))
#define XBARA_BWR_SEL28_SEL56(base, value) (XBARA_WR_SEL28_SEL56(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL28, field SEL57[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT57 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL28_SEL57 field. */
#define XBARA_RD_SEL28_SEL57(base) ((XBARA_SEL28_REG(base) & XBARA_SEL28_SEL57_MASK) >> XBARA_SEL28_SEL57_SHIFT)
#define XBARA_BRD_SEL28_SEL57(base) (XBARA_RD_SEL28_SEL57(base))

/*! @brief Set the SEL57 field to a new value. */
#define XBARA_WR_SEL28_SEL57(base, value) (XBARA_RMW_SEL28(base, XBARA_SEL28_SEL57_MASK, XBARA_SEL28_SEL57(value)))
#define XBARA_BWR_SEL28_SEL57(base, value) (XBARA_WR_SEL28_SEL57(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL29 - Crossbar A Select Register 29
 ******************************************************************************/

/*!
 * @brief XBARA_SEL29 - Crossbar A Select Register 29 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL29 register
 */
/*@{*/
#define XBARA_RD_SEL29(base)     (XBARA_SEL29_REG(base))
#define XBARA_WR_SEL29(base, value) (XBARA_SEL29_REG(base) = (value))
#define XBARA_RMW_SEL29(base, mask, value) (XBARA_WR_SEL29(base, (XBARA_RD_SEL29(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL29(base, value) (XBARA_WR_SEL29(base, XBARA_RD_SEL29(base) |  (value)))
#define XBARA_CLR_SEL29(base, value) (XBARA_WR_SEL29(base, XBARA_RD_SEL29(base) & ~(value)))
#define XBARA_TOG_SEL29(base, value) (XBARA_WR_SEL29(base, XBARA_RD_SEL29(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL29 bitfields
 */

/*!
 * @name Register XBARA_SEL29, field SEL58[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT58 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL29_SEL58 field. */
#define XBARA_RD_SEL29_SEL58(base) ((XBARA_SEL29_REG(base) & XBARA_SEL29_SEL58_MASK) >> XBARA_SEL29_SEL58_SHIFT)
#define XBARA_BRD_SEL29_SEL58(base) (XBARA_RD_SEL29_SEL58(base))

/*! @brief Set the SEL58 field to a new value. */
#define XBARA_WR_SEL29_SEL58(base, value) (XBARA_RMW_SEL29(base, XBARA_SEL29_SEL58_MASK, XBARA_SEL29_SEL58(value)))
#define XBARA_BWR_SEL29_SEL58(base, value) (XBARA_WR_SEL29_SEL58(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_CTRL0 - Crossbar A Control Register 0
 ******************************************************************************/

/*!
 * @brief XBARA_CTRL0 - Crossbar A Control Register 0 (RW)
 *
 * Reset value: 0x0000U
 *
 * Use this register to configure edge detection, interrupt, and DMA features
 * for the XBAR_OUT0 and XBAR_OUT1 outputs. The XBAR_CTRL registers are organized
 * similarly to the XBAR_SEL registers, with control fields for two XBAR_OUT
 * outputs in each register. In control register 0, the LSBs contain the control
 * fields for XBAR_OUT0, and the MSBs contain the control fields for XBAR_OUT1.
 */
/*!
 * @name Constants and macros for entire XBARA_CTRL0 register
 */
/*@{*/
#define XBARA_RD_CTRL0(base)     (XBARA_CTRL0_REG(base))
#define XBARA_WR_CTRL0(base, value) (XBARA_CTRL0_REG(base) = (value))
#define XBARA_RMW_CTRL0(base, mask, value) (XBARA_WR_CTRL0(base, (XBARA_RD_CTRL0(base) & ~(mask)) | (value)))
#define XBARA_SET_CTRL0(base, value) (XBARA_WR_CTRL0(base, XBARA_RD_CTRL0(base) |  (value)))
#define XBARA_CLR_CTRL0(base, value) (XBARA_WR_CTRL0(base, XBARA_RD_CTRL0(base) & ~(value)))
#define XBARA_TOG_CTRL0(base, value) (XBARA_WR_CTRL0(base, XBARA_RD_CTRL0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_CTRL0 bitfields
 */

/*!
 * @name Register XBARA_CTRL0, field DEN0[0] (RW)
 *
 * This bit enables the DMA function on the corresponding XBAR_OUT0 output. When
 * enabled, DMA_REQ0 presents the value STS0. When disabled, the DMA_REQ0 output
 * remains low. IEN0 and DEN0 should not both be set to 1.
 *
 * Values:
 * - 0 - DMA disabled
 * - 1 - DMA enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL0_DEN0 field. */
#define XBARA_RD_CTRL0_DEN0(base) ((XBARA_CTRL0_REG(base) & XBARA_CTRL0_DEN0_MASK) >> XBARA_CTRL0_DEN0_SHIFT)
#define XBARA_BRD_CTRL0_DEN0(base) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_DEN0_SHIFT))

