theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_extension.h
/*
 * Constants & macros for individual XBARB_SEL2 bitfields
 */

/*!
 * @name Register XBARB_SEL2, field SEL4[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT4 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL2_SEL4 field. */
#define XBARB_RD_SEL2_SEL4(base) ((XBARB_SEL2_REG(base) & XBARB_SEL2_SEL4_MASK) >> XBARB_SEL2_SEL4_SHIFT)
#define XBARB_BRD_SEL2_SEL4(base) (XBARB_RD_SEL2_SEL4(base))

/*! @brief Set the SEL4 field to a new value. */
#define XBARB_WR_SEL2_SEL4(base, value) (XBARB_RMW_SEL2(base, XBARB_SEL2_SEL4_MASK, XBARB_SEL2_SEL4(value)))
#define XBARB_BWR_SEL2_SEL4(base, value) (XBARB_WR_SEL2_SEL4(base, value))
/*@}*/

/*!
 * @name Register XBARB_SEL2, field SEL5[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT5 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL2_SEL5 field. */
#define XBARB_RD_SEL2_SEL5(base) ((XBARB_SEL2_REG(base) & XBARB_SEL2_SEL5_MASK) >> XBARB_SEL2_SEL5_SHIFT)
#define XBARB_BRD_SEL2_SEL5(base) (XBARB_RD_SEL2_SEL5(base))

/*! @brief Set the SEL5 field to a new value. */
#define XBARB_WR_SEL2_SEL5(base, value) (XBARB_RMW_SEL2(base, XBARB_SEL2_SEL5_MASK, XBARB_SEL2_SEL5(value)))
#define XBARB_BWR_SEL2_SEL5(base, value) (XBARB_WR_SEL2_SEL5(base, value))
/*@}*/

/*******************************************************************************
 * XBARB_SEL3 - Crossbar B Select Register 3
 ******************************************************************************/

/*!
 * @brief XBARB_SEL3 - Crossbar B Select Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL3 register
 */
/*@{*/
#define XBARB_RD_SEL3(base)      (XBARB_SEL3_REG(base))
#define XBARB_WR_SEL3(base, value) (XBARB_SEL3_REG(base) = (value))
#define XBARB_RMW_SEL3(base, mask, value) (XBARB_WR_SEL3(base, (XBARB_RD_SEL3(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL3(base, value) (XBARB_WR_SEL3(base, XBARB_RD_SEL3(base) |  (value)))
#define XBARB_CLR_SEL3(base, value) (XBARB_WR_SEL3(base, XBARB_RD_SEL3(base) & ~(value)))
#define XBARB_TOG_SEL3(base, value) (XBARB_WR_SEL3(base, XBARB_RD_SEL3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL3 bitfields
 */

/*!
 * @name Register XBARB_SEL3, field SEL6[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT6 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL3_SEL6 field. */
#define XBARB_RD_SEL3_SEL6(base) ((XBARB_SEL3_REG(base) & XBARB_SEL3_SEL6_MASK) >> XBARB_SEL3_SEL6_SHIFT)
#define XBARB_BRD_SEL3_SEL6(base) (XBARB_RD_SEL3_SEL6(base))

/*! @brief Set the SEL6 field to a new value. */
#define XBARB_WR_SEL3_SEL6(base, value) (XBARB_RMW_SEL3(base, XBARB_SEL3_SEL6_MASK, XBARB_SEL3_SEL6(value)))
#define XBARB_BWR_SEL3_SEL6(base, value) (XBARB_WR_SEL3_SEL6(base, value))
/*@}*/

/*!
 * @name Register XBARB_SEL3, field SEL7[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT7 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL3_SEL7 field. */
#define XBARB_RD_SEL3_SEL7(base) ((XBARB_SEL3_REG(base) & XBARB_SEL3_SEL7_MASK) >> XBARB_SEL3_SEL7_SHIFT)
#define XBARB_BRD_SEL3_SEL7(base) (XBARB_RD_SEL3_SEL7(base))

/*! @brief Set the SEL7 field to a new value. */
#define XBARB_WR_SEL3_SEL7(base, value) (XBARB_RMW_SEL3(base, XBARB_SEL3_SEL7_MASK, XBARB_SEL3_SEL7(value)))
#define XBARB_BWR_SEL3_SEL7(base, value) (XBARB_WR_SEL3_SEL7(base, value))
/*@}*/

/*******************************************************************************
 * XBARB_SEL4 - Crossbar B Select Register 4
 ******************************************************************************/

/*!
 * @brief XBARB_SEL4 - Crossbar B Select Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL4 register
 */
/*@{*/
#define XBARB_RD_SEL4(base)      (XBARB_SEL4_REG(base))
#define XBARB_WR_SEL4(base, value) (XBARB_SEL4_REG(base) = (value))
#define XBARB_RMW_SEL4(base, mask, value) (XBARB_WR_SEL4(base, (XBARB_RD_SEL4(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL4(base, value) (XBARB_WR_SEL4(base, XBARB_RD_SEL4(base) |  (value)))
#define XBARB_CLR_SEL4(base, value) (XBARB_WR_SEL4(base, XBARB_RD_SEL4(base) & ~(value)))
#define XBARB_TOG_SEL4(base, value) (XBARB_WR_SEL4(base, XBARB_RD_SEL4(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL4 bitfields
 */

/*!
 * @name Register XBARB_SEL4, field SEL8[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT8 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL4_SEL8 field. */
#define XBARB_RD_SEL4_SEL8(base) ((XBARB_SEL4_REG(base) & XBARB_SEL4_SEL8_MASK) >> XBARB_SEL4_SEL8_SHIFT)
#define XBARB_BRD_SEL4_SEL8(base) (XBARB_RD_SEL4_SEL8(base))

/*! @brief Set the SEL8 field to a new value. */
#define XBARB_WR_SEL4_SEL8(base, value) (XBARB_RMW_SEL4(base, XBARB_SEL4_SEL8_MASK, XBARB_SEL4_SEL8(value)))
#define XBARB_BWR_SEL4_SEL8(base, value) (XBARB_WR_SEL4_SEL8(base, value))
/*@}*/

/*!
 * @name Register XBARB_SEL4, field SEL9[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT9 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL4_SEL9 field. */
#define XBARB_RD_SEL4_SEL9(base) ((XBARB_SEL4_REG(base) & XBARB_SEL4_SEL9_MASK) >> XBARB_SEL4_SEL9_SHIFT)
#define XBARB_BRD_SEL4_SEL9(base) (XBARB_RD_SEL4_SEL9(base))

/*! @brief Set the SEL9 field to a new value. */
#define XBARB_WR_SEL4_SEL9(base, value) (XBARB_RMW_SEL4(base, XBARB_SEL4_SEL9_MASK, XBARB_SEL4_SEL9(value)))
#define XBARB_BWR_SEL4_SEL9(base, value) (XBARB_WR_SEL4_SEL9(base, value))
/*@}*/

/*******************************************************************************
 * XBARB_SEL5 - Crossbar B Select Register 5
 ******************************************************************************/

/*!
 * @brief XBARB_SEL5 - Crossbar B Select Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL5 register
 */
/*@{*/
#define XBARB_RD_SEL5(base)      (XBARB_SEL5_REG(base))
#define XBARB_WR_SEL5(base, value) (XBARB_SEL5_REG(base) = (value))
#define XBARB_RMW_SEL5(base, mask, value) (XBARB_WR_SEL5(base, (XBARB_RD_SEL5(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL5(base, value) (XBARB_WR_SEL5(base, XBARB_RD_SEL5(base) |  (value)))
#define XBARB_CLR_SEL5(base, value) (XBARB_WR_SEL5(base, XBARB_RD_SEL5(base) & ~(value)))
#define XBARB_TOG_SEL5(base, value) (XBARB_WR_SEL5(base, XBARB_RD_SEL5(base) ^  (value)))
/*@}*/

